Feature: Резервиране на места

  Scenario: Резервация на прожекция с въведени валидни данни
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Резервацията е успешна"

  Scenario: Резервация на прожекция без въведено грешно потребителско име
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име ""
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Моля, въведете потребителско име!"

  Scenario: Резервация на прожекция без въведен грешен номер на картата
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата ""
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Моля, въведете номер на картата!"

  Scenario: Резервация на прожекция без невъведен краен срок на картата
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата ""
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Моля, въведете краен срок на картата!"

  Scenario: Резервация на прожекция с въведена невалидна прожекция
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията ""
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Няма филм с такова име!"

  Scenario: Резервация на прожекция с въведено невалидно време на прожекция
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията ""
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Няма филм по това време! Моля, въведете времето на филма, който искате да гледате"

  Scenario: Резервация на прожекция без въведено валидно място на прожекция
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията ""
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Моля, въведете място на прожекцията!"

  Scenario: Резервация на прожекция с въведено вече заето място от друг потребтел по време на прожекцията
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "18.05.2022"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "17:00"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "2"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Мястото е запазено! Моля, изберете друго!"

  Scenario: Резервация на прожекция с въведени валидни данни при половин час преди прожекцията
    Given Потребитеял отваря екрана за резервация
    When Потребителя въведе потребителско име "Ivan"
    And Въведе номер на картата "1801321093"
    And Въведе дата на изтичане на картата "28.03.2021"
    And Въведе име на прожекцията "Ghost Rider"
    And Въведе време на прожекцията "09:30"
    And Въведе място на прожекцията "Eccoplexx Cinema Plovdiv"
    And Въведе номер на място в залата на прожекцията "42"
    And Натисне върху бутона за резервиране
    Then Вижда съобщение "Филмът започва след по-малко от час! Не може да направите резервация при по-малко от час преди започването на филма!"
